# MullionCornerType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MullionCornerType Property
ParameterTypeId Class See Also
---
"Corner Mullion"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MullionCornerType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MullionCornerType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MullionCornerType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace